public/about/about-site.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About This Site</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org9b73726" class="outline-2">
<h2 id="org9b73726">Introduction</h2>
<div class="outline-text-2" id="text-org9b73726">
<p>
I created this site as a portfolio for my various projects, but it's also a space for me to blog, learn more about maintaining my own website, and explore minor web development. I don't have a particular audience for any of this, but I find I understand things better when I have to explain concepts, so I already write out projects in a way that lends itself well to a website anyways.
</p>
</div>
</div>

<div id="outline-container-orgfd927b4" class="outline-2">
<h2 id="orgfd927b4">How This Site Was Built</h2>
<div class="outline-text-2" id="text-orgfd927b4">
<p>
This site is published on <a href="https://pages.github.com/">GitHub Pages</a> using <a href="https://www.gnu.org/software/emacs/">GNU Emacs</a>, <a href="https://orgmode.org/">Org Mode</a>, and <a href="https://jekyllrb.com">Jekyll</a>. The source code for this site can be found in this <a href="https://github.com/jdylanwhite/jdylanwhite.github.io">GitHub repository</a>. I use Emacs and Org Mode to write most of the actual content of the site. Jekyll helps with everything else, such as headers, navigation, and footers. I'll also convert <a href="https://jupyter.org/">Jupyter Notebooks</a> to be used on this site as well.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.8)</p>
</div>
</body>
</html>